src/test/dwmit/appendNamespace/out.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <tem:GetOrderById xmlns:tem="http://tempuri.org/">
      <tem:OrderId>656734</tem:OrderId>
    </tem:GetOrderById>
  </soapenv:Body>
</soapenv:Envelope>